{"id":{"0":1492443688131248130,"1":1492353708759339014,"2":1492151585127944193,"3":1492007630105161783,"4":1491904145086980097,"5":1491777502888570886,"6":1491670326194970624,"7":1491269365215686657,"8":1491088812386426884,"9":1490901401291362304,"10":1490800700258926593,"11":1490530574053871616,"12":1490347696300908552,"13":1490176957027430400,"14":1489905175296937987,"15":1489715389491818497,"16":1489389664121282560,"17":1489152686503178241,"18":1488856841639579652,"19":1488627900312133637,"20":1488436323942039555,"21":1488054406918684674,"22":1487636386110967809,"23":1487513059212079109,"24":1487217495777988612,"25":1486967160882835459,"26":1486820840272539649,"27":1486716885630554119,"28":1486456467020742657,"29":1486196667623870472,"30":1485894979230879749,"31":1485528777228750851,"32":1485218376851075075,"33":1485102733862621188,"34":1484875286747488257,"35":1484644057896861699,"36":1484423155485655046,"37":1484238150985789441,"38":1483947936853762052,"39":1483682819763277825,"40":1483580792916017152,"41":1483481438683021313,"42":1483287330140176385,"43":1483203711908425728,"44":1483087982437490693,"45":1482833199852142597,"46":1482505808193945604,"47":1482392793700245505,"48":1482100574782996481,"49":1481781090582990852,"50":1481652173906006016,"51":1481536592019922944,"52":1481343592425992192,"53":1481186700085043201,"54":1481129155135737857,"55":1480844378746798082,"56":1480504858851614720,"57":1480379397425225728,"58":1480225437217435655,"59":1480029637237428228,"60":1479946242687967234,"61":1479653552230383619,"62":1479497948954341379,"63":1479356892464001026,"64":1479038571919163395,"65":1478723910787125255,"66":1478517085575782408,"67":1478289758552006658,"68":1478164403396792323,"69":1477902603182870529,"70":1477800087707426822,"71":1477574517434339329,"72":1477397577293258752,"73":1477132753200107520,"74":1477033279723384837,"75":1476829510721064971,"76":1476744654414565376,"77":1476526573327200257,"78":1476421766222331907,"79":1476078922416758785,"80":1475955591197638657,"81":1475707172717797376,"82":1475497218044006402,"83":1475322277331976194,"84":1475179337401966595,"85":1474955485556137989,"86":1474864956336005120,"87":1474607866363486214,"88":1474477722344701954,"89":1474340200360779778,"90":1474219328954408960,"91":1474164587469672448,"92":1473891793049694209,"93":1473737422148149252,"94":1473415169594167297,"95":1473225758772367361,"96":1473034960248492036,"97":1472768949821575182,"98":1472736998704267270,"99":1472553953288151041},"full_text":{"0":"True friends are those who are willing to show up during all of your seasons - the good and bad, happy and sad, celebration and grief. The problem today is we have too many fair-weather friends.","1":"Don’t waste time in group chats and online chatter. Many spend hours each day on such frivolous activity and some even do it at the expense of the link with their Creator. Instead, get busy building a connection with the Almighty. Serve humanity. Life's way too short to waste.","2":"Often in life we get upset with what happens, especially when things don’t go according to our plan. We forget who is in control. The Lord of the Worlds has the best plans for us always, yet we often doubt, get upset and start questioning Him! Remember, He is the Best Planner.","3":"Almighty. We ask You for inner peace and contentment with whatever You have decreed for us. Let us go through it, bearing full patience, knowing You’re in control. Guide us to the best of manners, repel what’s bad from us, forgive all our sins and purify our hearts. Aameen.","4":"Do your best when faced with a challenge. Bear patience and give your utmost. When you think you’ve exhausted your resources and capabilities, that's when the help of the Almighty is closest. Wait for ease to unfold.","5":"Such is life. The only way some will talk about you is when they hear of bad news about you. They overlook the good you’ve done and become trigger-happy spreading whatever they hear without verifying anything. Let them do what they will. The Almighty knows.","6":"A heart does not turn cold unless it has been treated badly for a long while. So cherish all those with good hearts in your life. Don’t delay. Show them the gratitude they deserve.","7":"Beware the online world. When you let yourself go, you run into the danger of slipping too far into it and losing a sense of real life, real self and real priorities. It can distract people so much from reality that they may forget who they really are. It’s happening now.","8":"Be a beacon of hope and positivity in a world, that’s full of negativity and harsh criticism. How difficult is it to say a good word, to encourage and motivate others? And if you can’t, at least don’t hurt people with your words or actions. It’s best to remain quiet.","9":"You often hear people ask what if things don’t work out? What they mean is, if things don’t happen the way they planned it. They forget that the Almighty is the best planner. He will make things happen in the best possible way for us. Better than what we wanted. Trust Him.","10":"Never beg anyone for anything. Instead, always ask the Almighty. If He wills, He will grant it to you. Remember, nothing is impossible for the Lord of the Worlds.","11":"Kindness is contagious. Give your kindness away without expecting anything in return. The person you’re being kind to benefits through your help &amp; you'll feel good for having helped someone. The world is made better through your kindness. We need this badly today.","12":"When the Almighty tests you, instead of placing your hopes in other humans who are equally weak, place your trust in the Lord of the Worlds. Place your utmost hopes in Him and watch how He will help you through unimaginable circumstances.","13":"Charity begins at home. It’s no point being nice to outsiders when your family becomes your enemy at home. You curse, swear, nitpick over the smallest thing and never have a good word for them. You play mind games. Be careful. The Almighty is aware of all that you do.","14":"Be careful what you share on social media.  Even among our family members, there may be people who hide ill feelings towards our achievements &amp; lifestyles behind their smiles. The sad part is that most of the time, people envy what we know isn’t completely real.","15":"Make kindness your priority. Kind people use positivity to create more light. That’s because they’ve seen what negativity can do. They make time for others in a world that doesn’t wait for anyone. It takes strength to shake off all the bad and move forward.","16":"Almighty. Keep our hearts soft and protect them from hardening. Shower us with Your Mercy. When we commit a sin, allow us to feel the guilt that comes with it. Don’t make us among those who sin and yet aren’t remorseful. Aameen.","17":"Protect yourself as best you can because the evil eye is real. Take precautions. For many, this will be hard because we live in such a self-serving society. We want to show off. There’s a need within many of us to be validated &amp; accepted by others; even those we don’t know.","18":"The fact is some people will hate you for reasons known only to them. They won’t hesitate to spread rumours and gossip about you. This is a test from the Almighty. Don’t retaliate. Let the good you do speak for itself.","19":"Nothing can disturb your peace when you have attained that special connection with the Almighty. You fully submit to His Decree. He will provide for you in ways you never imagined. He will protect you from all harm. He will bless you with a kind heart and endear you to others.","20":"What the Almighty has done for others, He can do for you. Don’t get upset and envious when He does something for them. You need to understand His Plan. Celebrate the victory of others, be happy for them and He will grant you even more  just because you were patient.","21":"Quit negative thinking. There’s enough of that in the world today. Spread positive vibes. Be the voice of reason. Listen, empower, encourage, motivate and build people up.","22":"Pain is something you experience often enough. How it affects you is up to you. Some get really upset, bitter with life. Some take it in their stride; try their best to cope. Some smile &amp; breeze through it. Let your pain have a good purpose. Let it make you better &amp; stronger.","23":"Trust the Almighty’s timing. Only He knows why you're in the state you are for so long. Don’t fret because perhaps the delay in answering your prayer is better for you than  getting what you want, when you want it. Trust Him to get you out of the situation at the right time.","24":"Remember, if you hear something false about someone, defend him, speak up for him. The Almighty will defend you in this world and the next.","25":"Almighty. We ask You to remove our attachment to worldly things. Instead, make our hearts attached to You and make us love You more. Keep our hearts pure and always obedient in Your Path, no matter what’s going on in our lives. It’s the only way to have peace in our hearts.","26":"Trust the Almighty in your journey back to Him. The past may not have turned out the way you planned but remember, He is the best Planner and He can make your future better than you ever imagined.","27":"Treat people with respect and honour. Never mind how they choose to treat you. Don’t stoop to their level. Treat them with love and kindness. Why should you? For a simple reason that what you do will find its way back to you. The Almighty will make sure it does.","28":"Let go of things which don’t concern you. You’ll see your life take on a different turn. You’ll glow from within, be less stressed and have more time for the things that matter.","29":"Do you doubt that the Almighty can solve your problem? The Lord of the Worlds can turn night into day, what makes you think He can’t turn your burdens into blessings?","30":"Strength does not come from winning. Your struggles develop your strengths. The more you’ve gone through hardship and trials, the stronger you become.","31":"Do you have friends who will speak good about you behind your back? Friends who will stand up for you and defend you in your absence? If you have such friends, you’re blessed. Nurture the friendship.","32":"Rumours are dangerous and of course sinful. They can make you hate the righteous and love the hypocrites. Be careful. Stay away from the trap of Satan.","33":"Everything in life has a purpose. The Almighty does everything for a good reason. Learn from whatever comes your way. Nothing is a mistake or coincidence.","34":"There’s so much suffering going on around us. It’s a fact that we are better off than so many people in the world. Yet we complain. Our struggles are small compared to others. Count our blessings before the Almighty takes everything away.","35":"Do you feel like you’re constantly waiting? You wait for things to happen. In the process, you can either grow frustrated or you can grow in patience and strength. May the Almighty grant us the ability to wait patiently for what He has in store for us.","36":"Almighty! We ask You to strengthen us so we can face whatever challenges You put in our path. We know You see our tears and hear our prayers. We also know that You're testing us. Grant us the ability to endure and face the challenges with utmost patience. Aameen.","37":"Stay focused. Don’t quit at the first sign of failure. Good things come to those who persevere and put their trust in the Almighty. You may think that’s the hardest part but if you press on, you’ll succeed.","38":"We worry about things and look to other people for answers. There’s a better way to do this. Strengthen your link with the Almighty. He will prepare you for what’s to come and guide you along.","39":"Are you a pessimist? It's always easy to make things more problematic and negative than they really are. The next time you catch yourself making a mountain out of a molehill, ask yourself how much of it will matter in five years. Or, even next month. Change your mindset.","40":"We’ve all experienced pain and fear without exception. How we approach it will determine how we live our lives. Do you allow it to paralyze you such that moving forward becomes a chore? Don’t let your pain and fear define you. Use them to spur you to greater heights.","41":"@ReaazAhmed May Allah Almighty forgive his shortcomings, grant him Paradise and make it easy for his loved ones. Aameen","42":"Nothing in this life happens by chance. Everything the Almighty puts us through is to allow us to grow and to elevate our status.   Once you open your heart to your Creator, you’ll see Him in every part of your life. So read the signs and you’ll find contentment.","43":"Are you on the verge of giving up? Do you sometimes feel like things have become too difficult and there’s nothing good left for your future. That’s what Satan wants you to believe. Don’t fall for it. The Almighty says never lose hope in His Mercy.","44":"Don’t be afraid of change. At times, you need to overhaul your life to see your steps ahead. So whatever you’re experiencing, don’t be afraid to start over. This time, you’re not starting from scratch but you’re starting from experience.","45":"Keep asking the Almighty to soften our hearts. May we have compassion for those who suffer in unimaginable ways. Learn to pray passionately for them as we do for ourselves and our loved ones. Above all, may our souls remain humble at all times.","46":"Take criticism with a pinch of salt. Those doing more than you are unlikely to be the ones criticising you. You will almost always be criticised by people who are doing less.","47":"Grieve by all means but don’t let it consume you to such an extent that you forget who’s in control. Try to step away from your broken state, even if just for a moment. You’ll realise that you own nothing. Nothing at all. Everything is on loan from the Almighty.","48":"We think our problems will never get better. That’s our whole problem. We lack faith. We lack trust in the Almighty. Has it occurred to us that He already had the solution way before we had the problem?","49":"Almighty. Hear our humble, heartfelt prayers - for a world that’s fast falling apart, for people who are broken and injured, for hearts that have been shattered, for those who no longer have a home &amp; who've lost loved ones. We pray for ease and comfort. Aameen.","50":"Remember to engage your brain before the mouth is in gear. It’s easy to just blurt out what you feel in the heat of the moment. It takes only a few seconds of hurtful words to penetrate deep into a person’s heart and they may take years to heal, if at all.","51":"You may be in the depths of despair but remember, storms don’t last forever. They can shake you to the core. But they will pass. The Almighty has promised us, with hardship comes ease. So the rain will stop eventually and you’ll find peace after the chaos.","52":"People judge others based on their own actions, thoughts and ideas. Don't think others are sinful according to your standards. A good person always thinks good of others while the rest of the people will never be able to understand goodness. Work on yourselves first!","53":"Very Useful Sermon on Social Media. \nListen, like and share if you care!\n\nhttps:\/\/t.co\/UK1g4VA3o3","54":"At times, our suffering is caused by the pain and suffering we inflict on others. Remember justice will always prevail. If not today then tomorrow. Ultimately, nobody gets away with anything. The Almighty simply delays it to give us a chance to make amends.","55":"There’s so much hardship and suffering in the world. People are struggling with many issues from the pandemic to joblessness and mental health. Be kind in person and online. Don’t attack and condemn. Use good words and spread positivity.","56":"Your journey back to the Almighty might be a long one. But don’t get frustrated. Stay true to yourself. It takes a lot of effort. Guidance is a marathon, filled with ups and downs. Some days are better than others. But persevere &amp; seek His help. You’ll get there.","57":"Take things in your stride. I promise you, no matter how big your problems feel or whatever it is you are going through, you will look back and realise that you always had the strength to handle it. You are stronger and more capable than you think.","58":"Nourish your soul daily with what the Almighty has prescribed. That’s one sure way of fending off the ills of this world, leaving little room for satan’s plots.","59":"The Almighty is the only One who knows what’s in our hearts. So don’t belittle the efforts of anyone who’s trying to get close to Him. Don’t ever judge them according to your standard.","60":"Note to self: The mind replays what the heart cannot delete. So be careful what you keep in your heart. Purify it often with remembrance of your Creator.","61":"Remember, nothing is too small or too big for the Almighty. Just ask Him. He never gets bored listening to your prayer. He loves it when you seek Him.","62":"Learn from the mistakes you make in life. They are turning points. They bear important lessons. Remember, none of it is random. The Almighty designs them for a reason. They are meant to make you a better person. Correct yourself and move on.","63":"Almighty. Accept the deeds that we do solely for Your Sake. We are trying our best. We’re not perfect. We often falter, we sin, we make mistakes. Forgive us. We will never lose hope in Your Mercy and will always keep our hearts attached to You. Aameen.","64":"Don’t take things personally - an important aspect of self-care. When we don't take things personally, we recognize individuality and uniqueness in people. We accept that other people are different from us and that’s ok.","65":"Satan will remind you to focus on the burden &amp; miss the blessing. The Almighty has brought you this far. Do you think He will abandon you?","66":"Never underestimate the endless ripple effect of any act of goodness and kindness, no matter how small it is. Sooner or later, it will make its way back to you. Remember, what goes around, comes around. Perhaps not immediately but trust the Almighty to reward you eventually.","67":"Don’t tear someone down just to get yourself up there. Trust me it won’t last. The Almighty will see to that. Always be fair and just in all that you undertake.","68":"Say no to people who mess with your head. The ones who keep doing things intentionally to upset you. The ones who always play the victim even though it’s obvious they’re wrong. The ones who expect you to prioritise them but won’t do the same for you. Avoid them.","69":"Don’t pray only for yourself. Pray for others. Be generous with your prayers. Pray for those who have battles they don’t talk about.","70":"Don’t rush people. Give them the time and space they need to to heal from their hurt. We all deal with trials and tribulations in our own unique ways. Lend an ear,  a helping hand, make sure they know you’re there if they need you. That’s the best help you can offer.","71":"Repeat this as often as you need to. Reset, reorientate, revamp, restart, readjust, rethink, reposition, etc. Don’t let your history determine your future. Today is a brand new day. Trust the Almighty to lay out the best plans for you.","72":"Let’s face it. Most of the things we worry about in life are insignificant. Most of them we can’t control anyway. It’s the Almighty’s way of showing us who’s in control. So focus on being the best version of ourselves. Hand over the rest to Him.","73":"Almighty. Help me to trust Your timing and NOT my own. Aameen.","74":"Whatever’s going on around you, don’t let the negativity of the world depress you. Don't let your burdens drown you. Don’t think that your sins are the size of mountains and there’s no hope! Turn to the Almighty with sincere repentance. He loves those who repent.","75":"Almighty. Grant strength to those suffering in silence, where life is hard and they feel they can't go on. But they put on a brave front despite all that. Have mercy on them. Pick them up and help them get through the difficult period. Aameen.","76":"Are you on the verge of giving up? Don’t! Think of how far you’ve come. Everything you’ve been through; the times you thought you couldn’t make it but did; the mornings you couldn’t get out of bed but pushed yourself anyway. Always seek your strength from the Almighty.","77":"You’re trying hard and the Almighty knows. He will keep testing you to see if you’re sincere; if you’re striving your utmost and bearing patience. Honestly, that’s all that matters. That He is satisfied you tried your best.","78":"Remember, nothing lasts. Where you are today isn’t where you will stay. The Almighty has promised. Even the darkest night will end and the sun will rise with each new day. Keep hope alive in your heart. He’s right with you.","79":"We can't sit back and expect the Almighty to do everything for us. It's a two-way process. Show gratitude, get closer to Him. He'll guide us.","80":"Do you feel the need to answer to your critics? You don’t have to. You don’t have to try and prove to people who you are. Your journey is yours alone. Remain steadfast. Honour the Almighty. He will work things out for you in the end. Just remain calm and bear patience.","81":"Good days and bad days. You will learn more from the bad days than the good ones because they’re designed to toughen you. But first, you must learn the life lessons attached to them. Some don’t and they get stuck at a certain level. Pray for guidance.","82":"Many factors can affect the peace in your heart. It’s not easy but you must find a way to do it. Plug in with the Almighty. Let Him take over when you feel you’ve done your best. You’ll see every sunrise holds more promise; every sunset holds more peace.","83":"Do yourself a favour. Protect your mind from overthinking. It’s a disability which serves no purpose. You need to protect your own thoughts. There’s nothing in this world that can trouble you more than your own thoughts.","84":"We all get knocked down, some harder than others. That's a fact of life. Deal with it. Get up again. It'll help you grow. You're stronger than you think. You can do it. Quitting is never an option.","85":"Struggling in life is part of your journey. Nothing comes easy. Getting close to the Almighty is a lifelong process. You cannot expect everything to magically fall into place. You need to depend on Him and trust that what He has planned for you is the best.","86":"Has it occurred to you that each time you pray, it could be your last? So take your time and develop a no-rush policy when praying to your Creator. May the Almighty be pleased with us and have Mercy on us all, the day He decides to take us.","87":"Whatever your situation may be, the Almighty has all the answers; even if they aren’t the answers you want at that time. You have to trust Him when you face a closed door. After all, has He not brought you this far?  Do you think He will abandon you tomorrow?","88":"Relationships are suffering because we just can’t put our phones down. Parents &amp; children spend hours on mobile devices hence cutting down the time for face to face interaction. Make an effort to reduce the use of your devices &amp; start building healthy family bonds.","89":"Beware the ones who are distressed when good things come your way. But if harm strikes you, they will be among the first to rejoice. You have to be patient with them. Their plot will not harm you. The Almighty is the Best Planner.","90":"Almighty. Grant hope to those who feel broken and in need of comfort. It may be hard for some to focus on blessings when times are tough. When days look dark &amp; stress runs high, guide them to the path of light. Aameen.","91":"No squabble or argument is worth it; don't sacrifice your Hereafter for these pettiness. Avoid it and if you can’t, excuse yourself and walk away. Make peace with those you've offended or insulted.","92":"When you ask the Almighty, always do it wholeheartedly; always be certain that He will answer. Know that He will respond sooner or later. In fact, He knows what’s in your heart even before you asked Him. Don’t supplicate with an attitude of doubt and uncertainty. Trust Him.","93":"Without humility, you won’t go far in life, no matter how successful you think you are. There are many out there who strut around acting like they own the world. Stay away from such behaviour. Be humble. Be compassionate. Nothing belongs to us honestly. Reflect.","94":"Learn to ignore the behavior of toxic and irritating people. The truth is they are hurting; that’s why they choose to hurt others. They are full of fear and insecurity. Ignore the hate they spew. Respond with patience and love. Say a prayer for them.","95":"Nothing is guaranteed in life. Don’t take things for granted. Here today, gone tomorrow is real and many of us have seen it happen to our loved ones and close friends. We never know when our time will be up. So forgive, spread goodness and pray for a good end to our journey.","96":"Highs and lows are part of life. Don’t expect a smooth road. But the Almighty will never let you down if you bear beautiful patience and trust Him. Remember, your link with Him is eternal. Don’t waste time chasing this world because you’ll end up frustrated and miserable.","97":"May the Almighty protect the people of #Malaysia and the #Philippines from the floods and extreme weather they’re facing. The young, the sick and the elderly are the most vulnerable as they’re being evacuated to safer areas. May He grant ease and restore normalcy soon. Aameen.","98":"Give to charity what you would still want and use for yourself. Don’t just give discards, leftovers, etc. If you’re able to part with things you still want, you’ve shown the mark of a truly generous heart.","99":"Everything is going to work out in the end. Read that again. You have to trust the Almighty. Tell your heart not to be anxious. Do your best and hand it over to Him. Don’t overthink and don’t listen to whisperings in your head."},"clean_tweet":{"0":"True friends are those who are willing to show up during all of your seasons the good and bad happy and sad celebration and grief The problem today is we have too many fair weather friends","1":"Don t waste time in group chats and online chatter Many spend hours each day on such frivolous activity and some even do it at the expense of the link with their Creator Instead get busy building a connection with the Almighty Serve humanity Life s way too short to waste","2":"Often in life we get upset with what happens especially when things don t go according to our plan We forget who is in control The Lord of the Worlds has the best plans for us always yet we often doubt get upset and start questioning Him Remember He is the Best Planner","3":"Almighty We ask You for inner peace and contentment with whatever You have decreed for us Let us go through it bearing full patience knowing You re in control Guide us to the best of manners repel what s bad from us forgive all our sins and purify our hearts Aameen","4":"Do your best when faced with a challenge Bear patience and give your utmost When you think you ve exhausted your resources and capabilities that s when the help of the Almighty is closest Wait for ease to unfold","5":"Such is life The only way some will talk about you is when they hear of bad news about you They overlook the good you ve done and become trigger happy spreading whatever they hear without verifying anything Let them do what they will The Almighty knows","6":"A heart does not turn cold unless it has been treated badly for a long while So cherish all those with good hearts in your life Don t delay Show them the gratitude they deserve","7":"Beware the online world When you let yourself go you run into the danger of slipping too far into it and losing a sense of real life real self and real priorities It can distract people so much from reality that they may forget who they really are It s happening now","8":"Be a beacon of hope and positivity in a world that s full of negativity and harsh criticism How difficult is it to say a good word to encourage and motivate others And if you can t at least don t hurt people with your words or actions It s best to remain quiet","9":"You often hear people ask what if things don t work out What they mean is if things don t happen the way they planned it They forget that the Almighty is the best planner He will make things happen in the best possible way for us Better than what we wanted Trust Him","10":"Never beg anyone for anything Instead always ask the Almighty If He wills He will grant it to you Remember nothing is impossible for the Lord of the Worlds","11":"Kindness is contagious Give your kindness away without expecting anything in return The person you re being kind to benefits through your help amp you ll feel good for having helped someone The world is made better through your kindness We need this badly today","12":"When the Almighty tests you instead of placing your hopes in other humans who are equally weak place your trust in the Lord of the Worlds Place your utmost hopes in Him and watch how He will help you through unimaginable circumstances","13":"Charity begins at home It s no point being nice to outsiders when your family becomes your enemy at home You curse swear nitpick over the smallest thing and never have a good word for them You play mind games Be careful The Almighty is aware of all that you do","14":"Be careful what you share on social media Even among our family members there may be people who hide ill feelings towards our achievements amp lifestyles behind their smiles The sad part is that most of the time people envy what we know isn t completely real","15":"Make kindness your priority Kind people use positivity to create more light That s because they ve seen what negativity can do They make time for others in a world that doesn t wait for anyone It takes strength to shake off all the bad and move forward","16":"Almighty Keep our hearts soft and protect them from hardening Shower us with Your Mercy When we commit a sin allow us to feel the guilt that comes with it Don t make us among those who sin and yet aren t remorseful Aameen","17":"Protect yourself as best you can because the evil eye is real Take precautions For many this will be hard because we live in such a self serving society We want to show off There s a need within many of us to be validated amp accepted by others even those we don t know","18":"The fact is some people will hate you for reasons known only to them They won t hesitate to spread rumours and gossip about you This is a test from the Almighty Don t retaliate Let the good you do speak for itself","19":"Nothing can disturb your peace when you have attained that special connection with the Almighty You fully submit to His Decree He will provide for you in ways you never imagined He will protect you from all harm He will bless you with a kind heart and endear you to others","20":"What the Almighty has done for others He can do for you Don t get upset and envious when He does something for them You need to understand His Plan Celebrate the victory of others be happy for them and He will grant you even more just because you were patient","21":"Quit negative thinking There s enough of that in the world today Spread positive vibes Be the voice of reason Listen empower encourage motivate and build people up","22":"Pain is something you experience often enough How it affects you is up to you Some get really upset bitter with life Some take it in their stride try their best to cope Some smile amp breeze through it Let your pain have a good purpose Let it make you better amp stronger","23":"Trust the Almighty s timing Only He knows why you re in the state you are for so long Don t fret because perhaps the delay in answering your prayer is better for you than getting what you want when you want it Trust Him to get you out of the situation at the right time","24":"Remember if you hear something false about someone defend him speak up for him The Almighty will defend you in this world and the next","25":"Almighty We ask You to remove our attachment to worldly things Instead make our hearts attached to You and make us love You more Keep our hearts pure and always obedient in Your Path no matter what s going on in our lives It s the only way to have peace in our hearts","26":"Trust the Almighty in your journey back to Him The past may not have turned out the way you planned but remember He is the best Planner and He can make your future better than you ever imagined","27":"Treat people with respect and honour Never mind how they choose to treat you Don t stoop to their level Treat them with love and kindness Why should you For a simple reason that what you do will find its way back to you The Almighty will make sure it does","28":"Let go of things which don t concern you You ll see your life take on a different turn You ll glow from within be less stressed and have more time for the things that matter","29":"Do you doubt that the Almighty can solve your problem The Lord of the Worlds can turn night into day what makes you think He can t turn your burdens into blessings","30":"Strength does not come from winning Your struggles develop your strengths The more you ve gone through hardship and trials the stronger you become","31":"Do you have friends who will speak good about you behind your back Friends who will stand up for you and defend you in your absence If you have such friends you re blessed Nurture the friendship","32":"Rumours are dangerous and of course sinful They can make you hate the righteous and love the hypocrites Be careful Stay away from the trap of Satan","33":"Everything in life has a purpose The Almighty does everything for a good reason Learn from whatever comes your way Nothing is a mistake or coincidence","34":"There s so much suffering going on around us It s a fact that we are better off than so many people in the world Yet we complain Our struggles are small compared to others Count our blessings before the Almighty takes everything away","35":"Do you feel like you re constantly waiting You wait for things to happen In the process you can either grow frustrated or you can grow in patience and strength May the Almighty grant us the ability to wait patiently for what He has in store for us","36":"Almighty We ask You to strengthen us so we can face whatever challenges You put in our path We know You see our tears and hear our prayers We also know that You re testing us Grant us the ability to endure and face the challenges with utmost patience Aameen","37":"Stay focused Don t quit at the first sign of failure Good things come to those who persevere and put their trust in the Almighty You may think that s the hardest part but if you press on you ll succeed","38":"We worry about things and look to other people for answers There s a better way to do this Strengthen your link with the Almighty He will prepare you for what s to come and guide you along","39":"Are you a pessimist It s always easy to make things more problematic and negative than they really are The next time you catch yourself making a mountain out of a molehill ask yourself how much of it will matter in five years Or even next month Change your mindset","40":"We ve all experienced pain and fear without exception How we approach it will determine how we live our lives Do you allow it to paralyze you such that moving forward becomes a chore Don t let your pain and fear define you Use them to spur you to greater heights","41":"May Allah Almighty forgive his shortcomings grant him Paradise and make it easy for his loved ones Aameen","42":"Nothing in this life happens by chance Everything the Almighty puts us through is to allow us to grow and to elevate our status Once you open your heart to your Creator you ll see Him in every part of your life So read the signs and you ll find contentment","43":"Are you on the verge of giving up Do you sometimes feel like things have become too difficult and there s nothing good left for your future That s what Satan wants you to believe Don t fall for it The Almighty says never lose hope in His Mercy","44":"Don t be afraid of change At times you need to overhaul your life to see your steps ahead So whatever you re experiencing don t be afraid to start over This time you re not starting from scratch but you re starting from experience","45":"Keep asking the Almighty to soften our hearts May we have compassion for those who suffer in unimaginable ways Learn to pray passionately for them as we do for ourselves and our loved ones Above all may our souls remain humble at all times","46":"Take criticism with a pinch of salt Those doing more than you are unlikely to be the ones criticising you You will almost always be criticised by people who are doing less","47":"Grieve by all means but don t let it consume you to such an extent that you forget who s in control Try to step away from your broken state even if just for a moment You ll realise that you own nothing Nothing at all Everything is on loan from the Almighty","48":"We think our problems will never get better That s our whole problem We lack faith We lack trust in the Almighty Has it occurred to us that He already had the solution way before we had the problem","49":"Almighty Hear our humble heartfelt prayers for a world that s fast falling apart for people who are broken and injured for hearts that have been shattered for those who no longer have a home amp who ve lost loved ones We pray for ease and comfort Aameen","50":"Remember to engage your brain before the mouth is in gear It s easy to just blurt out what you feel in the heat of the moment It takes only a few seconds of hurtful words to penetrate deep into a person s heart and they may take years to heal if at all","51":"You may be in the depths of despair but remember storms don t last forever They can shake you to the core But they will pass The Almighty has promised us with hardship comes ease So the rain will stop eventually and you ll find peace after the chaos","52":"People judge others based on their own actions thoughts and ideas Don t think others are sinful according to your standards A good person always thinks good of others while the rest of the people will never be able to understand goodness Work on yourselves first","53":"Very Useful Sermon on Social Media Listen like and share if you care","54":"At times our suffering is caused by the pain and suffering we inflict on others Remember justice will always prevail If not today then tomorrow Ultimately nobody gets away with anything The Almighty simply delays it to give us a chance to make amends","55":"There s so much hardship and suffering in the world People are struggling with many issues from the pandemic to joblessness and mental health Be kind in person and online Don t attack and condemn Use good words and spread positivity","56":"Your journey back to the Almighty might be a long one But don t get frustrated Stay true to yourself It takes a lot of effort Guidance is a marathon filled with ups and downs Some days are better than others But persevere amp seek His help You ll get there","57":"Take things in your stride I promise you no matter how big your problems feel or whatever it is you are going through you will look back and realise that you always had the strength to handle it You are stronger and more capable than you think","58":"Nourish your soul daily with what the Almighty has prescribed That s one sure way of fending off the ills of this world leaving little room for satan s plots","59":"The Almighty is the only One who knows what s in our hearts So don t belittle the efforts of anyone who s trying to get close to Him Don t ever judge them according to your standard","60":"Note to self The mind replays what the heart cannot delete So be careful what you keep in your heart Purify it often with remembrance of your Creator","61":"Remember nothing is too small or too big for the Almighty Just ask Him He never gets bored listening to your prayer He loves it when you seek Him","62":"Learn from the mistakes you make in life They are turning points They bear important lessons Remember none of it is random The Almighty designs them for a reason They are meant to make you a better person Correct yourself and move on","63":"Almighty Accept the deeds that we do solely for Your Sake We are trying our best We re not perfect We often falter we sin we make mistakes Forgive us We will never lose hope in Your Mercy and will always keep our hearts attached to You Aameen","64":"Don t take things personally an important aspect of self care When we don t take things personally we recognize individuality and uniqueness in people We accept that other people are different from us and that s ok","65":"Satan will remind you to focus on the burden amp miss the blessing The Almighty has brought you this far Do you think He will abandon you","66":"Never underestimate the endless ripple effect of any act of goodness and kindness no matter how small it is Sooner or later it will make its way back to you Remember what goes around comes around Perhaps not immediately but trust the Almighty to reward you eventually","67":"Don t tear someone down just to get yourself up there Trust me it won t last The Almighty will see to that Always be fair and just in all that you undertake","68":"Say no to people who mess with your head The ones who keep doing things intentionally to upset you The ones who always play the victim even though it s obvious they re wrong The ones who expect you to prioritise them but won t do the same for you Avoid them","69":"Don t pray only for yourself Pray for others Be generous with your prayers Pray for those who have battles they don t talk about","70":"Don t rush people Give them the time and space they need to to heal from their hurt We all deal with trials and tribulations in our own unique ways Lend an ear a helping hand make sure they know you re there if they need you That s the best help you can offer","71":"Repeat this as often as you need to Reset reorientate revamp restart readjust rethink reposition etc Don t let your history determine your future Today is a brand new day Trust the Almighty to lay out the best plans for you","72":"Let s face it Most of the things we worry about in life are insignificant Most of them we can t control anyway It s the Almighty s way of showing us who s in control So focus on being the best version of ourselves Hand over the rest to Him","73":"Almighty Help me to trust Your timing and NOT my own Aameen","74":"Whatever s going on around you don t let the negativity of the world depress you Don t let your burdens drown you Don t think that your sins are the size of mountains and there s no hope Turn to the Almighty with sincere repentance He loves those who repent","75":"Almighty Grant strength to those suffering in silence where life is hard and they feel they can t go on But they put on a brave front despite all that Have mercy on them Pick them up and help them get through the difficult period Aameen","76":"Are you on the verge of giving up Don t Think of how far you ve come Everything you ve been through the times you thought you couldn t make it but did the mornings you couldn t get out of bed but pushed yourself anyway Always seek your strength from the Almighty","77":"You re trying hard and the Almighty knows He will keep testing you to see if you re sincere if you re striving your utmost and bearing patience Honestly that s all that matters That He is satisfied you tried your best","78":"Remember nothing lasts Where you are today isn t where you will stay The Almighty has promised Even the darkest night will end and the sun will rise with each new day Keep hope alive in your heart He s right with you","79":"We can t sit back and expect the Almighty to do everything for us It s a two way process Show gratitude get closer to Him He ll guide us","80":"Do you feel the need to answer to your critics You don t have to You don t have to try and prove to people who you are Your journey is yours alone Remain steadfast Honour the Almighty He will work things out for you in the end Just remain calm and bear patience","81":"Good days and bad days You will learn more from the bad days than the good ones because they re designed to toughen you But first you must learn the life lessons attached to them Some don t and they get stuck at a certain level Pray for guidance","82":"Many factors can affect the peace in your heart It s not easy but you must find a way to do it Plug in with the Almighty Let Him take over when you feel you ve done your best You ll see every sunrise holds more promise every sunset holds more peace","83":"Do yourself a favour Protect your mind from overthinking It s a disability which serves no purpose You need to protect your own thoughts There s nothing in this world that can trouble you more than your own thoughts","84":"We all get knocked down some harder than others That s a fact of life Deal with it Get up again It ll help you grow You re stronger than you think You can do it Quitting is never an option","85":"Struggling in life is part of your journey Nothing comes easy Getting close to the Almighty is a lifelong process You cannot expect everything to magically fall into place You need to depend on Him and trust that what He has planned for you is the best","86":"Has it occurred to you that each time you pray it could be your last So take your time and develop a no rush policy when praying to your Creator May the Almighty be pleased with us and have Mercy on us all the day He decides to take us","87":"Whatever your situation may be the Almighty has all the answers even if they aren t the answers you want at that time You have to trust Him when you face a closed door After all has He not brought you this far Do you think He will abandon you tomorrow","88":"Relationships are suffering because we just can t put our phones down Parents amp children spend hours on mobile devices hence cutting down the time for face to face interaction Make an effort to reduce the use of your devices amp start building healthy family bonds","89":"Beware the ones who are distressed when good things come your way But if harm strikes you they will be among the first to rejoice You have to be patient with them Their plot will not harm you The Almighty is the Best Planner","90":"Almighty Grant hope to those who feel broken and in need of comfort It may be hard for some to focus on blessings when times are tough When days look dark amp stress runs high guide them to the path of light Aameen","91":"No squabble or argument is worth it don t sacrifice your Hereafter for these pettiness Avoid it and if you can t excuse yourself and walk away Make peace with those you ve offended or insulted","92":"When you ask the Almighty always do it wholeheartedly always be certain that He will answer Know that He will respond sooner or later In fact He knows what s in your heart even before you asked Him Don t supplicate with an attitude of doubt and uncertainty Trust Him","93":"Without humility you won t go far in life no matter how successful you think you are There are many out there who strut around acting like they own the world Stay away from such behaviour Be humble Be compassionate Nothing belongs to us honestly Reflect","94":"Learn to ignore the behavior of toxic and irritating people The truth is they are hurting that s why they choose to hurt others They are full of fear and insecurity Ignore the hate they spew Respond with patience and love Say a prayer for them","95":"Nothing is guaranteed in life Don t take things for granted Here today gone tomorrow is real and many of us have seen it happen to our loved ones and close friends We never know when our time will be up So forgive spread goodness and pray for a good end to our journey","96":"Highs and lows are part of life Don t expect a smooth road But the Almighty will never let you down if you bear beautiful patience and trust Him Remember your link with Him is eternal Don t waste time chasing this world because you ll end up frustrated and miserable","97":"May the Almighty protect the people of Malaysia and the Philippines from the floods and extreme weather they re facing The young the sick and the elderly are the most vulnerable as they re being evacuated to safer areas May He grant ease and restore normalcy soon Aameen","98":"Give to charity what you would still want and use for yourself Don t just give discards leftovers etc If you re able to part with things you still want you ve shown the mark of a truly generous heart","99":"Everything is going to work out in the end Read that again You have to trust the Almighty Tell your heart not to be anxious Do your best and hand it over to Him Don t overthink and don t listen to whisperings in your head"},"created_at":{"0":1644661278000,"1":1644639825000,"2":1644591635000,"3":1644557313000,"4":1644532641000,"5":1644502447000,"6":1644476894000,"7":1644381297000,"8":1644338250000,"9":1644293568000,"10":1644269559000,"11":1644205156000,"12":1644161554000,"13":1644120847000,"14":1644056049000,"15":1644010801000,"16":1643933142000,"17":1643876642000,"18":1643806107000,"19":1643751523000,"20":1643705848000,"21":1643614791000,"22":1643515128000,"23":1643485724000,"24":1643415256000,"25":1643355572000,"26":1643320686000,"27":1643295902000,"28":1643233813000,"29":1643171872000,"30":1643099944000,"31":1643012634000,"32":1642938629000,"33":1642911058000,"34":1642856830000,"35":1642801701000,"36":1642749034000,"37":1642704925000,"38":1642635733000,"39":1642572524000,"40":1642548199000,"41":1642524511000,"42":1642478232000,"43":1642458296000,"44":1642430704000,"45":1642369959000,"46":1642291902000,"47":1642264958000,"48":1642195287000,"49":1642119116000,"50":1642088380000,"51":1642060823000,"52":1642014809000,"53":1641977403000,"54":1641963683000,"55":1641895787000,"56":1641814839000,"57":1641784927000,"58":1641748220000,"59":1641701537000,"60":1641681654000,"61":1641611872000,"62":1641574773000,"63":1641541142000,"64":1641465249000,"65":1641390228000,"66":1641340917000,"67":1641286718000,"68":1641256831000,"69":1641194413000,"70":1641169971000,"71":1641116191000,"72":1641074005000,"73":1641010866000,"74":1640987150000,"75":1640938568000,"76":1640918336000,"77":1640866342000,"78":1640841354000,"79":1640759613000,"80":1640730209000,"81":1640670981000,"82":1640620924000,"83":1640579215000,"84":1640545136000,"85":1640491765000,"86":1640470181000,"87":1640408886000,"88":1640377858000,"89":1640345070000,"90":1640316252000,"91":1640303200000,"92":1640238161000,"93":1640201356000,"94":1640124525000,"95":1640079366000,"96":1640033876000,"97":1639970455000,"98":1639962837000,"99":1639919195000},"in_reply_to":{"0":null,"1":null,"2":null,"3":null,"4":null,"5":null,"6":null,"7":null,"8":null,"9":null,"10":null,"11":null,"12":null,"13":null,"14":null,"15":null,"16":null,"17":null,"18":null,"19":null,"20":null,"21":null,"22":null,"23":null,"24":null,"25":null,"26":null,"27":null,"28":null,"29":null,"30":null,"31":null,"32":null,"33":null,"34":null,"35":null,"36":null,"37":null,"38":null,"39":null,"40":null,"41":"ReaazAhmed","42":null,"43":null,"44":null,"45":null,"46":null,"47":null,"48":null,"49":null,"50":null,"51":null,"52":null,"53":null,"54":null,"55":null,"56":null,"57":null,"58":null,"59":null,"60":null,"61":null,"62":null,"63":null,"64":null,"65":null,"66":null,"67":null,"68":null,"69":null,"70":null,"71":null,"72":null,"73":null,"74":null,"75":null,"76":null,"77":null,"78":null,"79":null,"80":null,"81":null,"82":null,"83":null,"84":null,"85":null,"86":null,"87":null,"88":null,"89":null,"90":null,"91":null,"92":null,"93":null,"94":null,"95":null,"96":null,"97":null,"98":null,"99":null},"source":{"0":"Twitter for Android","1":"Twitter for Android","2":"Twitter for Android","3":"Twitter for Android","4":"Twitter for Android","5":"Twitter for Android","6":"Twitter for Android","7":"Twitter for Android","8":"Twitter for Android","9":"Twitter for Android","10":"Twitter for Android","11":"Twitter for Android","12":"Twitter for Android","13":"Twitter for Android","14":"Twitter for Android","15":"Twitter for Android","16":"Twitter for Android","17":"Twitter for Android","18":"Twitter for Android","19":"Twitter for Android","20":"Twitter for Android","21":"Twitter for Android","22":"Twitter for Android","23":"Twitter for Android","24":"Twitter for Android","25":"Twitter for Android","26":"Twitter for Android","27":"Twitter for Android","28":"Twitter for Android","29":"Twitter for Android","30":"Twitter for Android","31":"Twitter for Android","32":"Twitter for Android","33":"Twitter for Android","34":"Twitter for Android","35":"Twitter for Android","36":"Twitter for Android","37":"Twitter for Android","38":"Twitter for Android","39":"Twitter for Android","40":"Twitter for Android","41":"Twitter for Android","42":"Twitter for Android","43":"Twitter for Android","44":"Twitter for Android","45":"Twitter for Android","46":"Twitter for Android","47":"Twitter for Android","48":"Twitter for Android","49":"Twitter for Android","50":"Twitter for Android","51":"Twitter for Android","52":"Twitter for Android","53":"Twitter for Android","54":"Twitter for Android","55":"Twitter for Android","56":"Twitter for Android","57":"Twitter for Android","58":"Twitter for Android","59":"Twitter for Android","60":"Twitter for Android","61":"Twitter for Android","62":"Twitter for Android","63":"Twitter for Android","64":"Twitter for Android","65":"Twitter for Android","66":"Twitter for Android","67":"Twitter for Android","68":"Twitter for Android","69":"Twitter for Android","70":"Twitter for Android","71":"Twitter for Android","72":"Twitter for Android","73":"Twitter for Android","74":"Twitter for Android","75":"Twitter for Android","76":"Twitter for Android","77":"Twitter for Android","78":"Twitter for Android","79":"Twitter for Android","80":"Twitter for Android","81":"Twitter for Android","82":"Twitter for Android","83":"Twitter for Android","84":"Twitter for Android","85":"Twitter for Android","86":"Twitter for Android","87":"Twitter for Android","88":"Twitter for Android","89":"Twitter for Android","90":"Twitter for Android","91":"Twitter for Android","92":"Twitter for Android","93":"Twitter for Android","94":"Twitter for Android","95":"Twitter for Android","96":"Twitter for Android","97":"Twitter for Android","98":"Twitter for Android","99":"Twitter for Android"},"retweets":{"0":3153,"1":3705,"2":5767,"3":6566,"4":5538,"5":5208,"6":8758,"7":6285,"8":5391,"9":6591,"10":10940,"11":8094,"12":6924,"13":7565,"14":9068,"15":6195,"16":7380,"17":7493,"18":7310,"19":6722,"20":6921,"21":8982,"22":8704,"23":7694,"24":8297,"25":7151,"26":6946,"27":7610,"28":7852,"29":8355,"30":7951,"31":8233,"32":6874,"33":8804,"34":6246,"35":7925,"36":6856,"37":9380,"38":5872,"39":5028,"40":4722,"41":40,"42":7663,"43":7009,"44":7634,"45":7998,"46":5136,"47":5101,"48":8129,"49":6795,"50":5933,"51":7282,"52":6670,"53":752,"54":5065,"55":7289,"56":5277,"57":6414,"58":3217,"59":4434,"60":8433,"61":10612,"62":7985,"63":5961,"64":6572,"65":9213,"66":6275,"67":8652,"68":9485,"69":13461,"70":9644,"71":8046,"72":7435,"73":12916,"74":6293,"75":7580,"76":6532,"77":6585,"78":10790,"79":7175,"80":5813,"81":8099,"82":5514,"83":13455,"84":7711,"85":9228,"86":5690,"87":6792,"88":6052,"89":4006,"90":6861,"91":3313,"92":7121,"93":8288,"94":8426,"95":9164,"96":6303,"97":11567,"98":4787,"99":9489},"likes":{"0":9800,"1":15069,"2":19601,"3":24046,"4":19980,"5":18058,"6":29828,"7":22612,"8":19527,"9":22897,"10":38823,"11":26330,"12":26996,"13":26897,"14":27982,"15":21540,"16":29599,"17":26906,"18":25623,"19":26850,"20":26921,"21":30837,"22":29152,"23":26549,"24":33523,"25":27447,"26":27130,"27":24908,"28":26597,"29":33493,"30":28441,"31":31793,"32":25650,"33":31877,"34":24048,"35":31284,"36":26873,"37":32481,"38":24610,"39":20834,"40":17807,"41":626,"42":27655,"43":25330,"44":25885,"45":29619,"46":21519,"47":19921,"48":31616,"49":27330,"50":20869,"51":26674,"52":23057,"53":3847,"54":20694,"55":25629,"56":21129,"57":24464,"58":16018,"59":19504,"60":30893,"61":39494,"62":25871,"63":24890,"64":24704,"65":37272,"66":23482,"67":30193,"68":29462,"69":44874,"70":30078,"71":28229,"72":27499,"73":52883,"74":23462,"75":28990,"76":23823,"77":24341,"78":35966,"79":30646,"80":21538,"81":27082,"82":20646,"83":43245,"84":27068,"85":29438,"86":25861,"87":25024,"88":23550,"89":16972,"90":25753,"91":14419,"92":27216,"93":26695,"94":26931,"95":28919,"96":23871,"97":29749,"98":17673,"99":31562},"quote_count":{"0":false,"1":false,"2":false,"3":false,"4":false,"5":false,"6":false,"7":false,"8":false,"9":false,"10":false,"11":false,"12":false,"13":false,"14":false,"15":false,"16":false,"17":false,"18":false,"19":false,"20":false,"21":false,"22":false,"23":false,"24":false,"25":false,"26":false,"27":false,"28":false,"29":false,"30":false,"31":false,"32":false,"33":false,"34":false,"35":false,"36":false,"37":false,"38":false,"39":false,"40":false,"41":false,"42":false,"43":false,"44":false,"45":false,"46":false,"47":false,"48":false,"49":false,"50":false,"51":false,"52":false,"53":false,"54":false,"55":false,"56":false,"57":false,"58":false,"59":false,"60":false,"61":false,"62":false,"63":false,"64":false,"65":false,"66":false,"67":false,"68":false,"69":false,"70":false,"71":false,"72":false,"73":false,"74":false,"75":false,"76":false,"77":false,"78":false,"79":false,"80":false,"81":false,"82":false,"83":false,"84":false,"85":false,"86":false,"87":false,"88":false,"89":false,"90":false,"91":false,"92":false,"93":false,"94":false,"95":false,"96":false,"97":false,"98":false,"99":false}}